of+1806/tutorials/channel_OldroydB/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 463.15;

boundaryField
{
    inlet
    {
	type            fixedValue;
	value           uniform 600.;
    }
    
    outlet
    {
    	type		zeroGradient;
    }

    walls
    {
	type            fixedValue;
	value           uniform 463.15;
    }
    
    cylinder
    {
    	type		zeroGradient;
    }
    
    frontAndBack
    {
        type           empty;
    }
    
}

// ************************************************************************* //
